src/InformationRegisters/ГП_КонтрагентыБП77.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ГП_КонтрагентыБП77</Name>
			<Comment>// Гарант+</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидКонтрагента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЮридическийАдрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПочтовыйАдрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Телефоны</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>23</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОКПО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>13</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КПП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>23</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументСерия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументКемВыдан</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>60</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументДатаВыдачи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОсновнойДоговорКод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>6</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОсновнойДоговорНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>85</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипЗаказчика</Name>
					<Comment>0 - покупатель (сч. 62.1), 1 - прочий дебитор (сч. 76.5)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипУслуги</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КонтрагентЮридическийАдресКЛАДР</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПочтовыйАдресКЛАДР</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>БанковскийСчетКод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГрузополучательКод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>8</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Группа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Очередность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Акцепт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контакт</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДопПризнак</Name>
					<Comment>Дополнительный признак</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СторонниеСубсидии</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Аванс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Согласие</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолнНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Код</Name>
					<Comment>Код контрагента в БП 7.7</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>8</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Comment>Связь с контрагентом ИБ</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/CommonModules/ГП_МиграцияБанковскихСчетов/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

Функция ЗаполнитьРегистрСчетаДляОплат(Знач Период, Знач ДанныеЗаполнения = Неопределено) Экспорт
    РезультатФункции = Новый Структура("Успех, КоличествоЗаписей, ТекстСообщения", Истина, 0);

    // Формирование данных для записи
    ДанныеЗаполнения = ?(ДанныеЗаполнения = Неопределено,
            ПолучитьДанныеЗаполненияСчетовДляОплат(), ДанныеЗаполнения);

    НачатьТранзакцию();
    Попытка
        Для Каждого СтрокаДанных Из ДанныеЗаполнения Цикл
            НовыйНаборЗаписей = РегистрыСведений.ГП_СчетаДляОплат.СоздатьНаборЗаписей();
            НовыйНаборЗаписей.Отбор.Период.Установить(Период);
            НовыйНаборЗаписей.Отбор.Контрагент.Установить(СтрокаДанных.Контрагент);

            НоваяЗапись = НовыйНаборЗаписей.Добавить();
            НоваяЗапись.Период = Период;
            НоваяЗапись.Контрагент = СтрокаДанных.Контрагент;
            НоваяЗапись.БанковскийСчет = СтрокаДанных.БанковскийСчет;

            НовыйНаборЗаписей.Записать(Истина);
            РезультатФункции.КоличествоЗаписей = РезультатФункции.КоличествоЗаписей + 1;
        КонецЦикла;

        ЗафиксироватьТранзакцию();

    Исключение
        ОтменитьТранзакцию();

        РезультатФункции.Успех = Ложь;
        РезультатФункции.КоличествоЗаписей = 0;
        РезультатФункции.ТекстСообщения = СтрШаблон(
                "Ошибка при записи в регистр ""ГП_СчетаДляОплат"".
                |Информация: %1", ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
    КонецПопытки;

    Возврат РезультатФункции;
КонецФункции

#КонецОбласти // ПрограммныйИнтерфейс

#Область СлужебныйПрограммныйИнтерфейс

// Возвращаемое значение:
//  - Соответствие
Функция ПолучитьСоответствиеНаименованийБанковскихСчетовПоКодамБП77() Экспорт
    РезультатФункции = Новый Соответствие;

    РезультатФункции.Вставить("00024", "Основной 108");
    РезультатФункции.Вставить("00002", "Основной 107");
    РезультатФункции.Вставить("00019", "Основной 107");
    РезультатФункции.Вставить("00013", "Основной 211");
    РезультатФункции.Вставить("00020", "Основной 004");
    РезультатФункции.Вставить("00014", "Основной 004");
    РезультатФункции.Вставить("00022", "Основной 2305");
    РезультатФункции.Вставить("00016", "Основной517");
    РезультатФункции.Вставить("00012", "Основной752");
    РезультатФункции.Вставить("00018", "Основной1361");
    РезультатФункции.Вставить("00021", "Основной 90658");
    РезультатФункции.Вставить("00017", "Основной1164");
    РезультатФункции.Вставить("00027", "Основной 850");
    РезультатФункции.Вставить("00026", "Основной 071");
    РезультатФункции.Вставить("00029", "Основной 030");
    РезультатФункции.Вставить("00025", "Основной 005");

    Возврат РезультатФункции;
КонецФункции

// Параметры:
//  Наименование - Строка
// Возвращаемое значение:
//  - СправочникСсылка.БанковскиеСчета, Неопределено
Функция ПолучитьБанковскийСчетПоНаименованию(Знач Наименование) Экспорт
    Запрос = Новый Запрос;
    Запрос.Текст =
        "ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
        |   *
        |ИЗ
        |   Справочник.БанковскиеСчета КАК БанковскиеСчета
        |ГДЕ
        |   ИСТИНА
        |   БанковскиеСчета.Наименование = &Наименование
        |   И БанковскиеСчета.ПометкаУдаления = ЛОЖЬ
        |";

    Запрос.УстановитьПараметр("Наименование", Наименование);
    РезультатЗапроса = Запрос.Выполнить();
    НайденныеБанковскиеСчета = РезультатЗапроса.Выгрузить();

    Если НайденныеБанковскиеСчета.Количество() = 0 Тогда
        Возврат Неопределено;
    КонецЕсли;

    Возврат НайденныеБанковскиеСчета[0];
КонецФункции

Функция ПолучитьДанныеЗаполненияСчетовДляОплат() Экспорт
    СоответствияНомеровСуществующихДоговоров = ГП_РаботаСДоговорами.ПолучитьТаблицуСоответствийНомеровНаименованийДоговоров();

    СоответствияКодовБанковскихСчетов = ГП_МиграцияБанковскихСчетов.ПолучитьСоответствиеНаименованийБанковскихСчетовПоКодамБП77();
    СоответствияБанковскихСчетов = Новый ТаблицаЗначений;
    СоответствияБанковскихСчетов.Колонки.Добавить("КодБП77", ОбщегоНазначения.ОписаниеТипаСтрока(15));
    СоответствияБанковскихСчетов.Колонки.Добавить("Наименование", ОбщегоНазначения.ОписаниеТипаСтрока(100));
    Для Каждого ЭлементКЗ Из СоответствияКодовБанковскихСчетов Цикл
        НоваяСтрока = СоответствияБанковскихСчетов.Добавить();
        НоваяСтрока.КодБП77 = ЭлементКЗ.Ключ;
        НоваяСтрока.Наименование = ЭлементКЗ.Значение;
    КонецЦикла;

    Запрос = Новый Запрос;
    Запрос.Текст =
        "ВЫБРАТЬ РАЗРЕШЕННЫЕ
        |	ВЫРАЗИТЬ(СоответствияНомеровСуществующихДоговоров.Ссылка КАК Справочник.ДоговорыКонтрагентов) КАК Ссылка,
        |	СоответствияНомеровСуществующихДоговоров.Наименование КАК Наименование,
        |	СоответствияНомеровСуществующихДоговоров.НомерИзНаименования КАК НомерИзНаименования
        |ПОМЕСТИТЬ ВТ_СоответствияНомеровСуществующихДоговоров
        |ИЗ
        |	&СоответствияНомеровСуществующихДоговоров КАК СоответствияНомеровСуществующихДоговоров
        |;
        |
        |////////////////////////////////////////////////////////////////////////////////
        |ВЫБРАТЬ РАЗРЕШЕННЫЕ
        |	СоответствияБанковскихСчетов.КодБП77 КАК КодБП77,
        |	СоответствияБанковскихСчетов.Наименование КАК Наименование
        |ПОМЕСТИТЬ ВТ_СоответствияБанковскихСчетовПодготовка
        |ИЗ
        |	&СоответствияБанковскихСчетов КАК СоответствияБанковскихСчетов
        |;
        |
        |////////////////////////////////////////////////////////////////////////////////
        |ВЫБРАТЬ РАЗРЕШЕННЫЕ
        |	БанковскиеСчета.Ссылка КАК Ссылка,
        |	ВТ_СоответствияБанковскихСчетовПодготовка.КодБП77 КАК КодБП77
        |ПОМЕСТИТЬ ВТ_СоответствияБанковскихСчетов
        |ИЗ
        |	Справочник.БанковскиеСчета КАК БанковскиеСчета
        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_СоответствияБанковскихСчетовПодготовка КАК ВТ_СоответствияБанковскихСчетовПодготовка
        |		ПО БанковскиеСчета.Наименование = ВТ_СоответствияБанковскихСчетовПодготовка.Наименование
        |			И (БанковскиеСчета.ПометкаУдаления = ЛОЖЬ)
        |;
        |
        |////////////////////////////////////////////////////////////////////////////////
        |ВЫБРАТЬ РАЗРЕШЕННЫЕ
        |	КонтрагентыБП77.Код КАК Код,
        |	КонтрагентыБП77.Наименование КАК Наименование,
        |	КонтрагентыБП77.ВидКонтрагента КАК ВидКонтрагента,
        |	КонтрагентыБП77.ИНН КАК ИНН,
        |	КонтрагентыБП77.ОКПО КАК ОКПО,
        |	КонтрагентыБП77.КПП КАК КПП,
        |	КонтрагентыБП77.ДокументСерия КАК ДокументСерия,
        |	КонтрагентыБП77.ДокументНомер КАК ДокументНомер,
        |	КонтрагентыБП77.ДокументКемВыдан КАК ДокументКемВыдан,
        |	КонтрагентыБП77.ДокументДатаВыдачи КАК ДокументДатаВыдачи,
        |	КонтрагентыБП77.ОсновнойДоговорКод КАК ОсновнойДоговорКод,
        |	КонтрагентыБП77.ОсновнойДоговорНаименование КАК ОсновнойДоговорНаименование,
        |	КонтрагентыБП77.БанковскийСчетКод КАК БанковскийСчетКод,
        |	КонтрагентыБП77.Группа КАК Группа,
        |	КонтрагентыБП77.ПолнНаименование КАК ПолнНаименование
        |ПОМЕСТИТЬ ВТ_АбонентыБП77
        |ИЗ
        |	РегистрСведений.ГП_КонтрагентыБП77 КАК КонтрагентыБП77
        |ГДЕ
        |	КонтрагентыБП77.Группа = ""Абоненты""
        |;
        |
        |////////////////////////////////////////////////////////////////////////////////
        |ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
        |	ВТ_АбонентыБП77.БанковскийСчетКод КАК БанковскийСчетКод,
        |	ВТ_СоответствияНомеровСуществующихДоговоров.Ссылка КАК Договор,
        |	ВТ_СоответствияНомеровСуществующихДоговоров.Ссылка.Владелец КАК Контрагент
        |ПОМЕСТИТЬ ВТ_РезультатПодготовка
        |ИЗ
        |	РегистрСведений.ГП_ЗданияБП77 КАК ЗданияБП77
        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_АбонентыБП77 КАК ВТ_АбонентыБП77
        |		ПО ЗданияБП77.КонтрагентКод = ВТ_АбонентыБП77.Код
        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_СоответствияНомеровСуществующихДоговоров КАК ВТ_СоответствияНомеровСуществующихДоговоров
        |		ПО ЗданияБП77.ДоговорНомер = ВТ_СоответствияНомеровСуществующихДоговоров.НомерИзНаименования
        |			И (НЕ ВТ_СоответствияНомеровСуществующихДоговоров.Ссылка.Владелец ЕСТЬ NULL)
        |			И (ВЫБОР
        |				КОГДА ВТ_АбонентыБП77.ИНН <> """"
        |					ТОГДА ВТ_СоответствияНомеровСуществующихДоговоров.Ссылка.Владелец.ИНН = ВТ_АбонентыБП77.ИНН
        |				ИНАЧЕ ВТ_СоответствияНомеровСуществующихДоговоров.Ссылка.Владелец.Наименование = ВТ_АбонентыБП77.Наименование
        |			КОНЕЦ)
        |ГДЕ
        |	ВТ_АбонентыБП77.БанковскийСчетКод <> """"
        |;
        |
        |////////////////////////////////////////////////////////////////////////////////
        |ВЫБРАТЬ РАЗРЕШЕННЫЕ
        |	ВТ_РезультатПодготовка.БанковскийСчетКод КАК БанковскийСчетКод,
        |	ВТ_РезультатПодготовка.Договор КАК Договор,
        |	ВТ_РезультатПодготовка.Контрагент КАК Контрагент,
        |	ВТ_СоответствияБанковскихСчетов.Ссылка КАК БанковскийСчет
        |ИЗ
        |	ВТ_РезультатПодготовка КАК ВТ_РезультатПодготовка
        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_СоответствияБанковскихСчетов КАК ВТ_СоответствияБанковскихСчетов
        |		ПО ВТ_РезультатПодготовка.БанковскийСчетКод = ВТ_СоответствияБанковскихСчетов.КодБП77
        |";

    Запрос.УстановитьПараметр("СоответствияНомеровСуществующихДоговоров", СоответствияНомеровСуществующихДоговоров);
    Запрос.УстановитьПараметр("СоответствияБанковскихСчетов", СоответствияБанковскихСчетов);

    РезультатЗапроса = Запрос.Выполнить();
    РезультатФункции = РезультатЗапроса.Выгрузить();
    Возврат РезультатФункции;
КонецФункции

#КонецОбласти // СлужебныйПрограммныйИнтерфейс
